In [4]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [5]:
data = [4, 7, -5, 3]
index = ["a", "b", "c", "d"]
pd_data = pd.Series(data)                    # index가 따라붙음
pd_data2 = pd.Series(data, index)            # index 수정 가능
print(pd_data2)

# a의 4선택
print(pd_data2["a"])

a    4
b    7
c   -5
d    3
dtype: int64
4

In [6]:
pd_data2[pd_data2>0]

a    4
b    7
d    3
dtype: int64

In [7]:
pd_data2*2

a     8
b    14
c   -10
d     6
dtype: int64

In [8]:
np.exp(pd_data2)

a      54.598150
b    1096.633158
c       0.006738
d      20.085537
dtype: float64

In [9]:
"d" in pd_data2

True

In [10]:
"f" in pd_data2

False

In [11]:
ser_data = {"Ohio":35000, "Texas":71000, "Oregon":16000, "Utah":5000}
pd_data3 = pd.Series(ser_data)
pd_data3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [12]:
ser_data = {"Ohio":35000, "Texas":71000, "Oregon":16000, "Utah":5000}
index = ['California', 'Ohio', 'Oregon', 'Utah']
pd_data4 = pd.Series(ser_data, index)
pd_data4

California        NaN
Ohio          35000.0
Oregon        16000.0
Utah           5000.0
dtype: float64

In [13]:
# 누락된 데이터 값 찾기_1

pd.isnull(pd_data4)

California     True
Ohio          False
Oregon        False
Utah          False
dtype: bool

In [14]:
# 누락된 데이터 값 찾기_2

pd.notnull(pd_data4)

California    False
Ohio           True
Oregon         True
Utah           True
dtype: bool

In [15]:
# Series의 인스턴스 메서드로 누락된 값 찾기
pd_data3.isnull()

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [16]:
pd_data4.name = "population"

In [17]:
pd_data4.index.name = "state"

In [18]:
pd_data4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Utah           5000.0
Name: population, dtype: float64

In [19]:
# DataFrame 만들기
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'] ,
       'year': [2000, 2001, 2002, 2001, 2002, 2003] ,
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
dframe1 = pd.DataFrame(data)
dframe1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [20]:
dframe1.head(5)                         # default 값은 '5'

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [21]:
dframe1.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [22]:
# 원하는 순서대로 columns 지정하기
dframe2 = pd.DataFrame(data, columns=['year', 'state', 'sales', 'pop'], 
                       index = ['No1', 'No2', 'No3', 'No4', 'No5', 'No6'])
dframe2

     year   state sales  pop
No1  2000    Ohio   NaN  1.5
No2  2001    Ohio   NaN  1.7
No3  2002    Ohio   NaN  3.6
No4  2001  Nevada   NaN  2.4
No5  2002  Nevada   NaN  2.9
No6  2003  Nevada   NaN  3.2

In [23]:
# column 내용을 도출하는 방법
dframe2['state']

No1      Ohio
No2      Ohio
No3      Ohio
No4    Nevada
No5    Nevada
No6    Nevada
Name: state, dtype: object

In [24]:
dframe2.year

No1    2000
No2    2001
No3    2002
No4    2001
No5    2002
No6    2003
Name: year, dtype: int64

In [25]:
# 행 내용을 도출하는 방법
dframe2.loc['No4']

year       2001
state    Nevada
sales       NaN
pop         2.4
Name: No4, dtype: object

In [26]:
# 비어있는 columns에 값 대입하기

dframe2['sales'] = 0
dframe2

     year   state  sales  pop
No1  2000    Ohio      0  1.5
No2  2001    Ohio      0  1.7
No3  2002    Ohio      0  3.6
No4  2001  Nevada      0  2.4
No5  2002  Nevada      0  2.9
No6  2003  Nevada      0  3.2

In [27]:
dframe2['sales'] = np.arange(6)
dframe2

     year   state  sales  pop
No1  2000    Ohio      0  1.5
No2  2001    Ohio      1  1.7
No3  2002    Ohio      2  3.6
No4  2001  Nevada      3  2.4
No5  2002  Nevada      4  2.9
No6  2003  Nevada      5  3.2

In [28]:
dframe2['sales'] = [100, 200, 300, 400, 500, 600]                       # 길이가 맞아야 대입 가능 
dframe2

     year   state  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2002  Nevada    500  2.9
No6  2003  Nevada    600  3.2

In [29]:
# Series를 대입하기위해선 꼭꼭 'index'를 지정해줘야함 / 대입값의 수와 인덱스의 길이가 일치해야함
index = ['No1', 'No2', 'No3', 'No4', 'No5', 'No6']
ser = pd.Series([100, 200, 300, 400, 500, 600], index)
dframe2['sales'] = ser
dframe2

     year   state  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2002  Nevada    500  2.9
No6  2003  Nevada    600  3.2

In [40]:
index = ['No1', 'No2', 'No3', 'No4', 'No5', 'No6']
ser = pd.Series([100, 200, 300, 400, 500, 600], index)
dframe2['additional'] = ser
dframe2

      Nevada  Ohio  additional
2001     2.4   1.7         NaN
2002     2.9   3.6         NaN
2000     NaN   1.5         NaN

In [41]:
# 칼럼 지우기

del dframe2['additional']
dframe2.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [42]:
pop_data = {
    'Nevada':{2001:2.4, 2002:2.9}, 
    'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}
}
dframe2 = pd.DataFrame(pop_data)
dframe2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [43]:
# 전치행렬
dframe2.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [44]:
dframe2 = pd.DataFrame(pop_data, index = [2000, 2001, 2002, 2003])
dframe2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [50]:
dframe2.index.name = 'year'
dframe2.columns.name = 'state'
dframe2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
2003      NaN   NaN

In [52]:
dframe2.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [53]:
dframe2.index

Int64Index([2000, 2001, 2002, 2003], dtype='int64', name='year')

In [54]:
dframe2.values                            # numpy array 형태    (pandas는 기본적으로 numpy형태사용 <= 빨라서)

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6],
       [nan, nan]])

In [57]:
# 원데이터 보호를 위해 dframe3
dframe3 = dframe2.reindex([2000, 2001, 2002, 2003, 2004])
dframe3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
2003      NaN   NaN
2004      NaN   NaN

In [58]:

dframe2 = dframe2.reindex([2000, 2001, 2002])
dframe2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [65]:
# 'ffill' 메소드를 통해 누락된 값을 직전의 값으로 채워줄 수 있음
### 만약 시계열 같은 순차적인 데이터를 재색인할 때 값을 보간하거나 채워넣어야할 경우가 있음. method를 통해 이를 해결 가능

df4 = pd.Series([100, 300, 500], index=[0, 2, 4])
print(df4)
df5 = df4.reindex(index=[0,1,2,3,4], method='ffill')         # reindex mehtod = (backfill, ffill, nearest)
print(df5)

0    100
2    300
4    500
dtype: int64
0    100
1    100
2    300
3    300
4    500
dtype: int64

In [66]:
dframe2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [69]:
df5 = dframe2.reindex(columns=["네바다", "오하이오"])
df5

state  네바다  오하이오
year
2000   NaN   NaN
2001   NaN   NaN
2002   NaN   NaN

In [70]:
# 하나의 로우나 컬럼 삭제하기

new_df5 = df5.drop(2001)               # 지우고 새로운 틀로 받아옴
new_df5

state  네바다  오하이오
year
2000   NaN   NaN
2002   NaN   NaN